var regInputPrompt="不能为空"							// 校验必填项为空后，对应的提示语
var regLengthPrompt="输入内容过多"						// 校验长度过长后，对应的提示语

var regName=/^[\u4E00-\u9FA5\uF900-\uFA2D]{2,5}$/;		// 校验姓名***********************************规则：2-5个长度的中文
var regNamePrompt="请输入2-5个长度的中文"				// 校验姓名后，对应的提示语

var regPhone=/^1[0-9]\d{9}$/;							// 校验手机号***********************************规则：11位数字且首位必须是1
var regPhonePrompt="请输入11位手机号码"					// 校验手机号后，对应的提示语
	
var regPosInteger=/^[0-9]*[1-9][0-9]*$/;				// 校验正整数***********************************规则：大于0的数字且不能是小数(不包含0)
var regPosIntegerPrompt="请输入大于0的整数"				// 校验正整数后，对应的提示语
	
var regPlateNumber=/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/;	// 校验车牌号
var regPlateNumberPrompt="请输入正确的车牌号"			// 校验车牌号后，对应的提示语
	
var regTwoDecimal=/^\d+(\.\d{1,2})?$/;					// 校验数字且最多两位小数
var regTwoDecimalPrompt="请输入数字且最多两位小数"		// 校验数字且最多两位小数，对应的提示语
	
var regThreeDecimal=/^\d+(\.\d{1,3})?$/;				// 校验数字且最多三位小数
var regThreeDecimalPrompt="请输入数字且最多三位小数"		// 校验数字且最多三位小数，对应的提示语
	
var regTenDecimal=/^((?!0)\d(\.\d{1,2})?)$/;				// 校验输入1-10之间的数字且最多两位小数***********************************规则：1-10之间的数字且最多两位小数,第一位数字不能是0
var regTenDecimalPrompt="请输入1-10之间的数字且最多两位小数"	// 校验输入1-10之间的数字且最多两位小数，对应的提示语